app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'richardillu942@gmail.com' limit 1
---
    public function store(Request $request): RedirectResponse
    {
        $credentials = $request->validate([
            'email' => ['required', 'string', 'email'],
            'password' => ['required', 'string'],
        ]);

        $user = User::where('email', $credentials['email'])->first();