app/Http/Controllers/Clubs/ClubController.php

select `id` from `hobbies` where `name` in ('Coding', 'Musik')
select * from `club_join_request` where `user_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `status` = 'pending'
select * from `hobbies` where `hobbies`.`id` in (3, 10)
---
    public function index()
    {
        $user = Auth::user();

        $allClubs = Club::withcount('members')->get();

        $userInterest = array_map('trim', $user->interest_array);

        $userInterestId = $userInterest ? Hobby::whereIn('name', $userInterest)->pluck('id') : collect();

        $pendingRequests = ClubJoinRequest::where('user_id', $user->id)
            ->where('status', 'pending')
            ->get()
            ->keyBy('club_id');

        $joinedClub = Club::withCount('members')
            ->whereHas('members', fn($q) => $q->where('user_id', $user->id))
            ->get();

        $joinedClubIds = $joinedClub->pluck('id');

        $recomendedClubs = $userInterestId->isNotEmpty()
            ? Club::with('hobby')
            ->withCount('members')
            ->whereIn('hobby_id', $userInterestId)
            ->whereNotIn('id', $joinedClubIds)
            ->get()