app/Http/Controllers/DashboardController.php

select `club_id` from `club_members` where `user_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392'
select * from `clubs` where `clubs`.`id` in ('2aa65262-62fe-4886-bc99-344c37ccbf90', '5b3870f0-eb4f-47dc-a298-c26810c6a9d5', '69ae3ff8-eaf3-4cd6-9367-77fda85b7966', 'c2b4bf97-ffea-486f-9130-b6c67a557f31', 'f71225b8-00b6-42a9-ac0e-6d4aafaaca69', 'fe08863c-74da-4aec-ab55-cc0ac4e8f42c')
select * from `comments` where `comments`.`post_id` in ('099caa25-5fa0-444c-9321-646f7c36c0fc', '10c2a823-37b5-4b45-a626-6f8ddd04329e', '114ba340-e376-4037-b725-3f8821f7b7e6', '21ae559c-88e3-4f40-8c6c-97e20ea81bb2', '21cd83c2-aa60-4b0d-aa67-a845416c9193', '25c252a0-8bd8-44a0-a744-a71f1bef1989', '32dff8e4-ad96-436e-9894-1398da6d3b45', '51cc95b8-e334-4ef7-8b20-e522734592bf', '5b657fd5-a1f7-4196-87d3-6211ee9c6aab', '5f156ec6-9a57-4a06-b543-4a7293681349', '64a6fcce-b67f-4185-9973-3b8ad80288b3', '679bad01-54ba-4de6-8e8e-c317ef083b1b', 'aaa2ae06-aa2f-4536-83f3-cabea4d3f226', 'c9d8170f-234d-4188-8aa8-5ce0e2af1000', 'e2acf0d2-63a0-46ca-a533-dbb183c3ca59', 'ea125732-79db-4dbf-89f0-f6ad560436fb', 'f474b51c-bef0-4aa9-84b4-6610d6f879d8', 'f4b57daf-5ba7-4d5c-81d5-90a87d55ab4b', 'f93ce74c-caef-4195-9bf0-84fac6a85f27', 'fd1daa5f-8d74-469b-b6d5-f81808417c71') order by `created_at` asc
select * from `likes` where `likes`.`post_id` in ('099caa25-5fa0-444c-9321-646f7c36c0fc', '10c2a823-37b5-4b45-a626-6f8ddd04329e', '114ba340-e376-4037-b725-3f8821f7b7e6', '21ae559c-88e3-4f40-8c6c-97e20ea81bb2', '21cd83c2-aa60-4b0d-aa67-a845416c9193', '25c252a0-8bd8-44a0-a744-a71f1bef1989', '32dff8e4-ad96-436e-9894-1398da6d3b45', '51cc95b8-e334-4ef7-8b20-e522734592bf', '5b657fd5-a1f7-4196-87d3-6211ee9c6aab', '5f156ec6-9a57-4a06-b543-4a7293681349', '64a6fcce-b67f-4185-9973-3b8ad80288b3', '679bad01-54ba-4de6-8e8e-c317ef083b1b', 'aaa2ae06-aa2f-4536-83f3-cabea4d3f226', 'c9d8170f-234d-4188-8aa8-5ce0e2af1000', 'e2acf0d2-63a0-46ca-a533-dbb183c3ca59', 'ea125732-79db-4dbf-89f0-f6ad560436fb', 'f474b51c-bef0-4aa9-84b4-6610d6f879d8', 'f4b57daf-5ba7-4d5c-81d5-90a87d55ab4b', 'f93ce74c-caef-4195-9bf0-84fac6a85f27', 'fd1daa5f-8d74-469b-b6d5-f81808417c71')
select * from `post_media` where `post_media`.`post_id` in ('099caa25-5fa0-444c-9321-646f7c36c0fc', '10c2a823-37b5-4b45-a626-6f8ddd04329e', '114ba340-e376-4037-b725-3f8821f7b7e6', '21ae559c-88e3-4f40-8c6c-97e20ea81bb2', '21cd83c2-aa60-4b0d-aa67-a845416c9193', '25c252a0-8bd8-44a0-a744-a71f1bef1989', '32dff8e4-ad96-436e-9894-1398da6d3b45', '51cc95b8-e334-4ef7-8b20-e522734592bf', '5b657fd5-a1f7-4196-87d3-6211ee9c6aab', '5f156ec6-9a57-4a06-b543-4a7293681349', '64a6fcce-b67f-4185-9973-3b8ad80288b3', '679bad01-54ba-4de6-8e8e-c317ef083b1b', 'aaa2ae06-aa2f-4536-83f3-cabea4d3f226', 'c9d8170f-234d-4188-8aa8-5ce0e2af1000', 'e2acf0d2-63a0-46ca-a533-dbb183c3ca59', 'ea125732-79db-4dbf-89f0-f6ad560436fb', 'f474b51c-bef0-4aa9-84b4-6610d6f879d8', 'f4b57daf-5ba7-4d5c-81d5-90a87d55ab4b', 'f93ce74c-caef-4195-9bf0-84fac6a85f27', 'fd1daa5f-8d74-469b-b6d5-f81808417c71')
---
    private function renderDashboard(string $activeMenu = 'home')
    {
        if (!Auth::check()) {
            return redirect()->route('login');
        }

        /** @var User|null $user */
        $user = Auth::user();
        $userId = Auth::id();

        // 1. Ambil list ID klub yang diikuti user
        $userClubIds = ClubMember::where('user_id', $userId)->pluck('club_id');

        // 2. Ambil data klub untuk widget/sidebar
        $joinedClub = Club::query()
            ->whereIn('id', $userClubIds->take(3))
            ->withCount('members')
            ->get();

        // 3. Tarik postingan dari klub yang diikuti user
        $feedPosts = Post::query()
            ->whereIn('club_id', $userClubIds)
            ->with([
                'author',
                'club',
                'media',
                'comments' => function ($query) {
                    $query->with('user')->oldest();
                },
                'likes'
            ])
            ->withCount(['comments', 'likes'])
            ->latest()
            ->take(20)
            ->get();

        // Fallback jika belum ada postingan dari klub yang diikuti
        if ($feedPosts->isEmpty()) {
            $feedPosts = Post::query()
                ->with([
                    'author',
                    'club',
                    'media',
                    'comments' => function ($query) {
                        $query->with('user')->oldest();
                    },
                    'likes'
                ])
                ->withCount(['comments', 'likes'])
                ->latest()
                ->take(20)
                ->get();