app/Http/Controllers/DashboardController.php

    public function index(): View
    {
        $user = Auth::user();

        $joinedClub = ClubMember::where('user_id', $user->id)->pluck('club_id')
            ->take(3);
---
select "club_id" from "club_members" where "user_id" = '01a0e60c-c867-71c9-ac7d-69b9b351e80a'