app/Http/Controllers/MessageController.php

    public function index()
    {
        $authId = Auth::id();

        // Get all partner IDs involved in messages with auth user
        $sentTo = Message::where('sender_id', $authId)->pluck('receiver_id');
        $receivedFrom = Message::where('receiver_id', $authId)->pluck('sender_id');
        $partnerIds = $sentTo->merge($receivedFrom)->unique()->values();

        $conversations = collect();

        foreach ($partnerIds as $partnerId) {
            $partner = User::find($partnerId);
            if (!$partner) {
                continue;
            }

            $lastMessage = Message::where(function ($q) use ($authId, $partnerId) {
                $q->where('sender_id', $authId)->where('receiver_id', $partnerId);
            })->orWhere(function ($q) use ($authId, $partnerId) {
                $q->where('sender_id', $partnerId)->where('receiver_id', $authId);
            })->orderByDesc('send_at')->first();

            $unreadCount = Message::where('sender_id', $partnerId)
                ->where('receiver_id', $authId)
                ->where('is_read', false)
                ->count();
---
select `receiver_id` from `messages` where `sender_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392'
select `sender_id` from `messages` where `receiver_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392'
select * from `users` where `users`.`id` = '2d5a6e93-f877-4cd4-8143-40ddb068123c' limit 1
select * from `messages` where (`sender_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `receiver_id` = '2d5a6e93-f877-4cd4-8143-40ddb068123c') or (`sender_id` = '2d5a6e93-f877-4cd4-8143-40ddb068123c' and `receiver_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392') order by `send_at` desc limit 1
select count(*) as aggregate from `messages` where `sender_id` = '2d5a6e93-f877-4cd4-8143-40ddb068123c' and `receiver_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `is_read` = 0

        $conversations = $conversations->sortByDesc(fn($c) => $c->last_message?->send_at)->values();

        // Suggested users to start new chat
        $suggestedUsers = User::where('id', '!=', $authId)
            ->whereNotIn('id', $partnerIds)
            ->limit(6)
            ->get();
---
select * from `users` where `id` != '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `id` not in ('2d5a6e93-f877-4cd4-8143-40ddb068123c', '3998a4ed-ab43-4db0-bbd1-8fc4c1c583be') limit 6

    public function show($conversation)
    {
        $authId = Auth::id();
        $otherUser = User::findOrFail($conversation);

        // Mark unread messages from this user as read
        Message::where('sender_id', $otherUser->id)
            ->where('receiver_id', $authId)
            ->where('is_read', false)
            ->update(['is_read' => true]);

        // Retrieve conversation messages
        $messages = Message::where(function ($q) use ($authId, $otherUser) {
            $q->where('sender_id', $authId)->where('receiver_id', $otherUser->id);
        })->orWhere(function ($q) use ($authId, $otherUser) {
            $q->where('sender_id', $otherUser->id)->where('receiver_id', $authId);
        })->orderBy('send_at', 'asc')->get();
---
select * from `users` where `users`.`id` = '48ecef4f-80c7-4960-97e8-45ed41f60074' limit 1
update `messages` set `is_read` = 1 where `sender_id` = '48ecef4f-80c7-4960-97e8-45ed41f60074' and `receiver_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `is_read` = 0
select * from `messages` where (`sender_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `receiver_id` = '48ecef4f-80c7-4960-97e8-45ed41f60074') or (`sender_id` = '48ecef4f-80c7-4960-97e8-45ed41f60074' and `receiver_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392') order by `send_at` asc

    public function store(Request $request, $conversation)
    {
        $request->validate([
            'content' => 'required|string|max:5000',
        ]);

        $authId = Auth::id();
        $otherUser = User::findOrFail($conversation);

        $message = Message::create([
            'sender_id' => $authId,
            'receiver_id' => $otherUser->id,
            'content' => trim($request->content),
            'is_read' => false,
            'send_at' => now(),
        ]);
---
select * from `users` where `users`.`id` = '2d5a6e93-f877-4cd4-8143-40ddb068123c' limit 1
insert into `messages` (`sender_id`, `receiver_id`, `content`, `is_read`, `send_at`, `id`) values ('01a0e639-0426-728d-a1f2-9cc6a4b6e392', '2d5a6e93-f877-4cd4-8143-40ddb068123c', 'hai', 0, '2026-09-28 04:15:46', '01a0e639-daf9-70b3-aaf0-22f556635c96')