app/Http/Controllers/NotificationController.php

select count(*) as aggregate from `notifications` where `notifications`.`user_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `notifications`.`user_id` is not null
---
    public function index(): View {
        $notifications = auth()->user()
        ->notifications()
        ->paginate(20);