app/Http/Controllers/PostController.php

select "clubs".*, "club_members"."user_id" as "pivot_user_id", "club_members"."club_id" as "pivot_club_id" from "clubs" inner join "club_members" on "clubs"."id" = "club_members"."club_id" where "club_members"."user_id" = '01a0e60c-c867-71c9-ac7d-69b9b351e80a'
---
    public function index()
    {
        $user = Auth::user();

        $posts = Post::where('user_id', $user->id)
            ->with(['club', 'media'])
            ->withCount(['comments', 'likes'])
            ->latest()
            ->get();

        $totalPosts = $posts->count();
        $totalLikes = $posts->sum('likes_count');