app/Providers/AppServiceProvider.php

select * from `notifications` where `notifications`.`user_id` = '01a0e639-0426-728d-a1f2-9cc6a4b6e392' and `notifications`.`user_id` is not null order by `created_at` desc limit 5
---
    public function boot(): void
    {
        View::composer('layouts.partials.notification-panel', function ($view) {
            $view->with('notifications', auth()->check()
                ? auth()->user()->notifications()->take(5)->get()